```
$ mkdir -p ~/aiffel/data_handling/data
$ mv f-27-data.zip  ~/aiffel/data_handling/data
$ cd  ~/aiffel/data_handling/data
$ unzip f-27-data.zip
```
Data : https://aiffelstaticprd.blob.core.windows.net/media/documents/f-27-data.zip

In [118]:
def summarize():
    #파일 이름을 입력 받는다.
    #파일을 읽기모드로 열어 한 줄씩 파일을 읽는다. 
    #파일의 각 행의 데이터 속성을 갖는 인스턴스 객체(사원객체)를 만든다. 
      # 사전에 employee 클래스 설계 필요!
      # 사전에 인스턴스 사원 객체를 만드는 함수 필요!  
    #월급이 가장 높은 사원을 찾는 코드를 구현한다. 
    #결과를 출력한다. 
    
    pass

In [119]:
# 인스턴스.속성값   으로 인스턴스 변수를 불러올 수 있지만 보통 이렇게 안씀.
class Employee:
    def __init__ (self, name, division, jobgrade, years, basic):
        self.name = name
        self.division = division
        self.jobgrade = int(jobgrade)
        self.years = int(years)
        self.basic = float(basic)

In [14]:
e1=Employee(name="AhnTaeHee",division = 'AI Team', jobgrade=3
           ,years=3,basic=300)
e1.name

'AhnTaeHee'

In [41]:
import os
file_path=os.getenv("HOME")+ '/aiffel/data_handling/data/employeefile.txt'
inputfile=open(file_path,'r')

print(type(inputfile))


for i in inputfile:
    print(i)
    print(type(i))

<class '_io.TextIOWrapper'>
Ahn TaeHee, AITeam, 3, 3, 300

<class 'str'>
Kim YoungJae, Sales, 9, 7, 600

<class 'str'>
Son HoMin, Marketing, 4, 4, 350

<class 'str'>
Park YoungA, Design, 1, 3, 320

<class 'str'>
Lee EnJae, Development, 2, 1, 200
<class 'str'>

In [48]:
def make_employee(inputdata):
    name, division, jobgrade, years, basic = inputdata.split(',')
    return Employee(name,division,jobgrade,years,basic)


for i in inputfile:
    e=make_employee(i)

list

In [106]:
import pandas as pd

df1 = pd.DataFrame({'Student': ['KimTaemin','HaJaehwa','JungSayoung','Sonjimin','Leesoomin','KangJun'],
                    'Korean': [90, 85, 88, 35, 40, 44],
                    'English': [80, 90, 40, 44, 55, 90]})
df2 = pd.DataFrame({'Student': ['HaJaehwa','JungSayoung','Sonjimin','Leesoomin','KangJun'],
                    'Korean': [55, 38, 43, 68, 82]})
print(df1)
print('------')
print(df2)

       Student  Korean  English
0    KimTaemin      90       80
1     HaJaehwa      85       90
2  JungSayoung      88       40
3     Sonjimin      35       44
4    Leesoomin      40       55
5      KangJun      44       90
------
       Student  Korean
0     HaJaehwa      55
1  JungSayoung      38
2     Sonjimin      43
3    Leesoomin      68
4      KangJun      82

In [89]:
pd.merge(df1,df2, how ='outer')

       Student  Korean  English  Math
0    KimTaemin      90       80   NaN
1     HaJaehwa      85       90  55.0
2  JungSayoung      88       40  38.0
3     Sonjimin      35       44  43.0
4    Leesoomin      40       55  68.0
5      KangJun      44       90  82.0

In [91]:
pd.merge(df1,df2)

       Student  Korean  English  Math
0     HaJaehwa      85       90    55
1  JungSayoung      88       40    38
2     Sonjimin      35       44    43
3    Leesoomin      40       55    68
4      KangJun      44       90    82

In [109]:
df1 = pd.DataFrame({'Student': ['KimTaemin','HaJaehwa','JungSayoung','Sonjimin','Leesoomin','KangJun'],
                    'Korean': [90, 85, 88, 35, 40, 44],
                    'English': [80, 90, 40, 44, 55, 90]})
df2 = pd.DataFrame({'Student': ['Jiyoungmin','KimTaemin'],
                    'Math':[44,33]})

print(df1)
print(df2)

       Student  Korean  English
0    KimTaemin      90       80
1     HaJaehwa      85       90
2  JungSayoung      88       40
3     Sonjimin      35       44
4    Leesoomin      40       55
5      KangJun      44       90
      Student  Math
0  Jiyoungmin    44
1   KimTaemin    33

In [93]:
pd.merge(df1,df2)

     Student  Korean  English  Math
0  KimTaemin      90       80    33

In [94]:
pd.merge(df1,df2,how='outer')

       Student  Korean  English  Math
0    KimTaemin    90.0     80.0  33.0
1     HaJaehwa    85.0     90.0   NaN
2  JungSayoung    88.0     40.0   NaN
3     Sonjimin    35.0     44.0   NaN
4    Leesoomin    40.0     55.0   NaN
5      KangJun    44.0     90.0   NaN
6   Jiyoungmin     NaN      NaN  44.0

In [96]:
df1.join(df2, how='outer', lsuffix='_caller', rsuffix='_other') 
# '_caller'인 df1 컬럼이 왼쪽에 가도록 배치

  Student_caller  Korean  English Student_other  Math
0      KimTaemin      90       80    Jiyoungmin  44.0
1       HaJaehwa      85       90     KimTaemin  33.0
2    JungSayoung      88       40           NaN   NaN
3       Sonjimin      35       44           NaN   NaN
4      Leesoomin      40       55           NaN   NaN
5        KangJun      44       90           NaN   NaN

In [100]:
df1 = pd.DataFrame({'Student': ['KimTaemin','HaJaehwa','JungSayoung','Sonjimin','Leesoomin','KangJun'],
                    'Korean': [90, 85, 88, 35, 40, 44],
                    'English': [80, 90, 40, 44, 55, 90]})
df2 = pd.DataFrame({'Student': ['Jiyoungmin','LeeJae','KimJaehee'],
                    'Korean': [44,73,100]})

print(df1)
print(df2)

       Student  Korean  English
0    KimTaemin      90       80
1     HaJaehwa      85       90
2  JungSayoung      88       40
3     Sonjimin      35       44
4    Leesoomin      40       55
5      KangJun      44       90
      Student  Korean
0  Jiyoungmin      44
1      LeeJae      73
2   KimJaehee     100

In [116]:
pd.concat([df1,df2], sort=False)

       Student  Korean  English  Math
0    KimTaemin    90.0     80.0   NaN
1     HaJaehwa    85.0     90.0   NaN
2  JungSayoung    88.0     40.0   NaN
3     Sonjimin    35.0     44.0   NaN
4    Leesoomin    40.0     55.0   NaN
5      KangJun    44.0     90.0   NaN
0   Jiyoungmin     NaN      NaN  44.0
1    KimTaemin     NaN      NaN  33.0

In [117]:
pd.concat([df1, df2], sort=False, ignore_index=True)

       Student  Korean  English  Math
0    KimTaemin    90.0     80.0   NaN
1     HaJaehwa    85.0     90.0   NaN
2  JungSayoung    88.0     40.0   NaN
3     Sonjimin    35.0     44.0   NaN
4    Leesoomin    40.0     55.0   NaN
5      KangJun    44.0     90.0   NaN
6   Jiyoungmin     NaN      NaN  44.0
7    KimTaemin     NaN      NaN  33.0

![nn](F-27.png)

In [120]:
df = pd.DataFrame({"A": [1,4,7], "B": [2,5,8], "C":[3,6,9]})

df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [121]:
df['A']

0    1
1    4
2    7
Name: A, dtype: int64

In [122]:
df['B']

0    2
1    5
2    8
Name: B, dtype: int64

In [165]:
df.loc[0]

A    1
B    2
C    3
Name: 0, dtype: int64

In [169]:
df.loc[[0]]

   A  B  C
0  1  2  3

In [173]:
df.loc[0,'C']

3

In [177]:
df.loc[1:,'A']

1    4
2    7
Name: A, dtype: int64

In [187]:
df.loc[1]

A    4
B    5
C    6
Name: 1, dtype: int64

In [186]:
df.iloc[1]

A    4
B    5
C    6
Name: 1, dtype: int64

In [185]:
df.iloc[:,0]

0    1
1    4
2    7
Name: A, dtype: int64

In [188]:
df = pd.DataFrame({'Columns1':['A','A','B','B','C','C','A','B'],
                   'Columns2':[10, 2, 30, -6, 8, 9, 5, 2]})

df

  Columns1  Columns2
0        A        10
1        A         2
2        B        30
3        B        -6
4        C         8
5        C         9
6        A         5
7        B         2

In [195]:
df.groupby(df['Columns1']).count()
#. max(), min(), sum(),mean()

          Columns2
Columns1
A                3
B                3
C                2

In [197]:
import pandas as pd
import numpy as np

file_path = os.getenv("HOME") + '/aiffel/data_handling/data/Salaries.csv'
sal = pd.read_csv(file_path)
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148645 entries, 0 to 148644
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148645 non-null  int64
 1   EmployeeName      148645 non-null  object
 2   JobTitle          148645 non-null  object
 3   BasePay           148040 non-null  float64
 4   OvertimePay       148645 non-null  float64
 5   OtherPay          148645 non-null  float64
 6   Benefits          112486 non-null  float64
 7   TotalPay          148645 non-null  float64
 8   TotalPayBenefits  148645 non-null  float64
 9   Year              148645 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148645 non-null  object
 12  Status            38114 non-null   object
dtypes: float64(7), int64(2), object(4)
memory usage: 14.7+ MB

In [198]:
sal["BasePay"].mean()

66327.6889596918

In [199]:
sal['OvertimePay'].max()

245131.88

In [202]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [203]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [206]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [212]:
sal.groupby("Year")['BasePay'].mean()

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66573.154204
Name: BasePay, dtype: float64

In [214]:
sal['JobTitle'].nunique()

2158

In [218]:
sal['JobTitle'].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [222]:
def chief_string(x):
    x=x.lower()
    if 'chief' in x:
        return 1
    else:
        return 0

sum(sal['JobTitle'].apply(lambda x : chief_string(x)))

627